Updated README and added architecture diagram
